// По заданному номеру дня недели вывести его название.

Console.Write("Введите число номер дня недели:  ");
int day = int.Parse(Console.ReadLine()!);

int a = 1;
int b = 2;
int c = 3;
int d = 4;
int e = 5;
int f = 6;
int g = 7;

if (day == a) Console.WriteLine("Понедельник день тяжелый.");

if (day == b) Console.WriteLine("Вторник");

if (day == c) Console.WriteLine("Среда");

if (day == d) Console.WriteLine("Четверг");

if (day == e) Console.WriteLine("Пятница, можно по пивку вечером!");

if (day == f) Console.WriteLine("Суббота, ууу Барбара Стрейзанд! Отдыхаем веселимся!");

if (day == g) Console.WriteLine("Воскресение, спокойный выходной.");

// 1. Пишем строку запроса в консоли, которая будет запрашивать номер дня недели.
// 2. Задаем переменную "day" и приравниваем ей строку ввода, куда пользователь будет вводить день недели
// 3. Задаем переменные и приравниваем им номер дня недели.
// 4. Задаем условие "if" где пишем формулу: если переменная "day" сторого равна задонному пользователем числу, то на выводе получаем строку равную переменной


